<a href="https://colab.research.google.com/github/N-Linh/nguyenvlinh_N1_sckitlearn_practice/blob/master/titanic_classification.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data_train = pd.read_csv('train.csv')
data_train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
data_test = pd.read_csv('test.csv')
data_test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [ ]:
data_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
data_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [ ]:
data_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
data_test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [ ]:
from sklearn.impute import SimpleImputer
imr_train = SimpleImputer(missing_values=np.nan, strategy='mean')
imr_train = imr_train.fit(data_train[['Age']])
data_train[['Age']] = imr_train.transform(data_train[['Age']]).ravel()

imr_test = SimpleImputer(missing_values=np.nan, strategy='mean')
imr_test = imr_test.fit(data_test[['Age']])
data_test[['Age']] = imr_test.transform(data_test[['Age']]).ravel()

In [ ]:
data_train['Age'].isnull().sum()

0

In [ ]:
data_test['Age'].isnull().sum()

0

In [ ]:
data_train['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [ ]:
data_train['Embarked'].fillna("S", inplace=True)
data_train['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [ ]:
data_test['Fare'].fillna(data_test['Fare'].mean(), inplace = True)
data_test['Fare'].isnull().sum()

0

In [ ]:
data_train = data_train.drop(['PassengerId','Cabin', 'Ticket', 'Name'], axis = 1)
data_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  891 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

In [ ]:
passengerId_test_data = data_test['PassengerId']
data_test = data_test.drop(['PassengerId', 'Ticket', 'Name', 'Cabin'], axis = 1)
data_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       418 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Fare      418 non-null    float64
 6   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 23.0+ KB

In [ ]:
#encoder
from sklearn.preprocessing import LabelEncoder
labelencoder_sex_Train = LabelEncoder()
data_train[['Sex']] = labelencoder_sex_Train.fit_transform(data_train[['Sex']].astype('str'))

labelencoder_embarked_Train = LabelEncoder()
data_train[['Embarked']] = labelencoder_sex_Train.fit_transform(data_train[['Embarked']].astype('str'))

data_train.head()

/usr/local/lib/python3.6/dist-packages/sklearn/preprocessing/_label.py:251: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

In [ ]:
labelencoder_sex_Test = LabelEncoder()
data_test[['Sex']] = labelencoder_sex_Test.fit_transform(data_test[['Sex']].astype('str'))

labelencoder_embarked_Test = LabelEncoder()
data_test[['Embarked']] = labelencoder_sex_Test.fit_transform(data_test[['Embarked']].astype('str'))

data_test.head()

/usr/local/lib/python3.6/dist-packages/sklearn/preprocessing/_label.py:251: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  34.5      0      0   7.8292         1
1       3    0  47.0      1      0   7.0000         2
2       2    1  62.0      0      0   9.6875         1
3       3    1  27.0      0      0   8.6625         2
4       3    0  22.0      1      1  12.2875         2

In [ ]:
#training
X = data_train.drop(['Survived'], axis = 1)
y = data_train[['Survived']]

In [ ]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2)

In [ ]:
from sklearn.linear_model import LogisticRegression

train_model = LogisticRegression()
lr = train_model.fit(X_train, y_train)

/usr/local/lib/python3.6/dist-packages/sklearn/utils/validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [ ]:
y_predict = train_model.predict(X_test)

predict_set = pd.DataFrame({'predicted' : y_predict, 'actural' : y_test['Survived']});
predict_set.head()

     predicted  actural
59           0        0
486          1        1
110          0        0
378          0        0
352          0        0

In [ ]:
#predict data test
data_test_predict = train_model.predict(data_test)

In [ ]:
submit_file = pd.DataFrame({
    'PassengerId' : passengerId_test_data,
    'Survived' : data_test_predict
})

submit_file.to_csv('predict_data_submit.csv', index = False)

In [65]:
from sklearn.metrics import classification_report
print(classification_report(y_predict, y_test['Survived']))

              precision    recall  f1-score   support

           0       0.88      0.79      0.83       119
           1       0.65      0.78      0.71        60

    accuracy                           0.79       179
   macro avg       0.77      0.79      0.77       179
weighted avg       0.80      0.79      0.79       179

In [70]:
from sklearn.metrics import accuracy_score
print('accuracy: {0}'.format(accuracy_score(y_predict, y_test['Survived'])))

accuracy: 0.7877094972067039

In [71]:
#compare gender submission data
gender_submission = pd.read_csv('gender_submission.csv')
gender_submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [78]:
from sklearn.metrics import accuracy_score
print('accuracy: {0}'.format(accuracy_score(gender_submission['Survived'], submit_file['Survived'])))

accuracy: 0.9425837320574163